In [1]:
import pandas as pd

path = "C:/Users/rapa/Desktop/빅데이터분석기사실기/basic1(t114).csv"

df = pd.read_csv(path)
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [11]:
find_value = df.sort_values(by = 'f1', ascending = False)
print(find_value.head())
value = find_value['f1'].iloc[9]
print(value)

      id   age city     f1  f2   f3    f4         f5
56  id57   3.0   대구  111.0   0  NaN  ISFJ  29.269869
7   id08  38.0   서울  101.0   1  NaN  INFJ  83.685380
57  id58   0.0   대구  100.0   2  NaN  ESTP  33.308999
73  id74  45.0   경기   98.0   0  NaN  ESTP  52.667078
71  id72   8.0   경기   97.0   0  NaN  ESTJ  97.381034
88.0

In [14]:

df['f1'] = df['f1'].fillna(value = value)
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울  88.0   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울  88.0   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [21]:

# 기존 중앙값
result1 = df['f1'].median()

In [22]:
# ** drop_duplicates 이 함수 암기하기.

print(df.shape)

df2 = df.drop_duplicates(subset = ['age'])
df2.shape

(100, 8)

(71, 8)

In [23]:
result2 = df2['f1'].median()
print(result2)

77.0

In [24]:
result1 - result2

0.5